# 1 "환영합니다." , "파이썬의 세계에 오신 것을 환영합니다.", "파이썬은 강력합니다." 를 화면에 출력하는 프로그램을 작성하시오
print("환영합니다.", "파이썬의 세계에 오신 것을 환영합니다.", "파이썬은 강력합니다.")   #print함수를 사용해서 출력
print("환영합니다.")
print("파이썬의 세계에 오신 것을 환영합니다.")
print("파이썬은 강력합니다.")

# 2 다음 프로그램의 실행 결과를 쓰시오
print("반갑습니다. 파이썬!")
print(2*3/10)                                                                      # *는 곱하기 , /는 나누기
print("hello", "world", "!!!")

# 3 파이썬 쉘을 사용하여 한 주가 몇시간에 해당하는지를 계산해보자
print(7*24)

# 4 터틀 그래픽에서 거북이를 이동시켜서 다음과 같은 그림을 그려보자. foward(), right(), left() 함수만을 사용한다
import turtle                                                                        # turtle 불러오기
t = turtle .Turtle()                                                                 # 편의를 위해 t값 사용해서 줄이기 지정하기
t.shape("turtle")                                                                    # t 모양을 거북이 모양으로 한다는 뜻
t.forward(100)                                                                       # t를 100만큼 이동
t.left(90)                                                                           # t를 왼쪽으로 90도 회전
t.forward(100)                                                                       # t를 100만큼 이동
t.right(90)                                                                          # t를 오른쪽으로 90도 회전
t.forward(100)                                                                       # t를 100만큼 이동
t.right(90)                                                                          # t를 오른쪽으로 90도 회전
t.forward(100)                                                                       # t를 100만큼 이동
t.left(90)                                                                           # t를 왼쪽으로 90도 회전
t.forward(100)                                                                       # t를 100만큼 이동
t._screen.exitonclick()                                                              # 마우스로 화면을 클릭해야 종료
